import 'package:math_app/models/theory.dart';

const theories = [
  Theory(
      id: 'Theory1',
      subjectId: 'math',
      chapterId: 'algebra',
      gradeId: '7grade',
      topicId: 'topic1',
      title: "Числовые и алгебраические выражения",
      paragraphs: [
        "Числовое выражение состоит из чисел и знаков арифметических действий между ними, также может содержать скобки для указания порядка действий. Числовое выражение должно иметь смысл.",
        "Алгебраическое выражение состоит из букв и чисел, между которыми стоят знаки арифметических действий, также может содержать скобки. Алгебраическое выражение должно иметь смысл.",
        "some paragraphs"
      ],
      imagesUrl: [
        'some imagesurls',
        'more images urls'
      ]),
  Theory(
      id: 'Theory2',
      subjectId: 'math',
      chapterId: 'algebra',
      gradeId: '7grade',
      topicId: 'topic1',
      title: "Числовые выражения",
      paragraphs: [
        "Числовое выражение состоит из чисел и знаков арифметических действий между ними, также может содержать скобки для указания порядка действий. Числовое выражение должно иметь смысл.",
        "Алгебраическое выражение состоит из букв и чисел, между которыми стоят знаки арифметических действий, также может содержать скобки. Алгебраическое выражение должно иметь смысл.",
        "some paragraphs"
      ],
      imagesUrl: [
        'some imagesurls',
        'more images urls'
      ]),
];
